target_race:Man
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_23 (InputLayer)        (None, 1, 62)             0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               326656    
_________________________________________________________________
dense_4 (Dense)              (None, 62)                15934     
_________________________________________________________________
activation_19 (Activation)   (None, 62)                0         
=================================================================
Total params: 342,590
Trainable params: 342,590
Non-trainable params: 0
_________________________________________________________________
