{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_9", 0, 0]], "output_layers": [["activation_9", 0, 0]], "layers": [{"name": "input_9", "config": {"batch_input_shape": [null, 5, 49], "sparse": false, "dtype": "float32", "name": "input_9"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "lstm_9", "config": {"implementation": 1, "name": "lstm_9", "return_sequences": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "tanh", "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "return_state": false, "recurrent_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "units": 16, "trainable": true, "use_bias": true, "bias_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activity_regularizer": null, "go_backwards": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dense_9", "config": {"trainable": true, "use_bias": true, "name": "dense_9", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "units": 49}, "inbound_nodes": [[["lstm_9", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_9", "config": {"trainable": true, "name": "activation_9", "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["dense_9", 0, 0, {}]]], "class_name": "Activation"}], "name": "model_9"}, "keras_version": "2.1.5-tf"}